import codecs
import time
import unicodedata

def is_letter(char, letter):
    nfkd = unicodedata.normalize('NFKD', char)
    stripped = ''.join(c for c in nfkd if not unicodedata.combining(c))
    casefolded = stripped.casefold()
    if letter == 'σ':
        if not is_letter(char, 'ς'):
            return casefolded == letter
    else:
        return casefolded == letter
    

def letter_check(letter):
    ls = []
    for i in range(0x10FFFF + 1):
        char = chr(i)
        if is_letter(char, letter):
            ls.append([f'{i:04X}', char])
    return ls

def main():
    alpha = {
    "1": ["00C1", "Á"],
    '2': ['1F0A', 'Ἂ'],
    "3": ["00E1", "á"],
    "4": ["00E0", "à"],
    "5": ["00E2", "â"],
    "6": ["00C4", "Ä"],
    "7": ["00E4", "ä"],
    '8': ['0391', 'Α'],
    '9': ['03B1', 'α'],
    '10': ['1F08', 'Ἀ'],
    '11': ['1F00', 'ἀ'],
    '12': ['1F0C', 'Ἄ'],
    '13': ['1F04', 'ἄ'],
    '16': ['1F02', 'ἂ'],
    '18': ['1F0E', 'Ἆ'],
    '19': ['1F06', 'ἆ'],
    '22': ['1F00', 'ᾀ'],
    '23': ['1F08', 'ᾈ'],
    '24': ['1F09', 'Ἁ'],
    '25': ['1F01', 'ἁ'],
    '26': ['1F05', 'ἅ'],
    '27': ['1F0D', 'Ἅ'],
    '29': ['1F05', 'ᾅ'],
    '30': ['1F03', 'ἃ'],
    '31': ['1F0F', 'Ἇ'],
    '32': ['1F07', 'ἇ'],
    '35': ['1F01', 'ᾁ'],
    '36': ['03AC', 'ά'],
    '37': ['0386', 'Ά'],
    '38': ['1FB4', 'ᾴ'],
    '39': ['1F70', 'ὰ'],
    '40': ['1FBA', 'Ὰ'],
    '41': ['1FB2', 'ᾲ'],
    '42': ['1FB6', 'ᾶ'],
    '43': ['1FB7', 'ᾷ'],
    '44': ['1FBC', 'ᾼ'],
    '45': ['03B1 0323', 'α̣'],
    '46': ['1FB3', 'ᾳ'],
    '47': ['1F84', 'ᾄ'],
    '48': ['1F80', 'ᾀ'],
    '49': ['1F0B', 'Ἃ'],
    '50': ['1F82', '50'],
    '51': ['1F86', 'ᾆ'],
    '52': ['1F87', 'ᾇ'],
    '53': ['1F8E', 'ᾎ'],
    '54': ['1F8C', 'ᾌ'],
    '55': ['1F81', 'ᾁ'],
    '56': ['1F88', 'ᾈ'],
    '57': ['1F8D', 'ᾍ'],
    '58': ['1F8F', 'ᾏ'],
    '59': ['1F85', 'ᾅ'],
    '60': ['03B1 035C', 'α͜']
    }
    beta = {
    '1': ['0392', 'Β'],
    '2': ['03B2', 'β']
    }
    gamma = {
    '1': ['0393', 'Γ'],
    '2': ['03B3', 'γ'],
    '3': ['03B3 0323', 'γ̣']
    }
    delta = {
    '1': ['0394', 'Δ'],
    '2': ['03B4', 'δ'],
    '3': ['03B4 0323', 'δ̣']
    }
    epsilon = {
    '1': ['00C9', 'É'],
    '2': ['03B5', 'ε'],
    '3': ['03B5 0323', 'ε̣'],
    '4': ['1F72', 'ὲ'],
    '5': ['00E9', 'é'],
    '6': ['00E8', 'è'],
    '7': ['00C8', 'È'],
    '8': ['00EA', 'ê'],
    '9': ['00EB', 'ë'],
    '10': ['00CB', 'Ë'],
    '11': ['0395', 'Ε'],
    '12': ['1F10', 'ἐ'],
    '13': ['1F18', 'Ἐ'],
    '14': ['1F1C', 'Ἔ'],
    '15': ['1F14', 'ἔ'],
    '16': ['1F1A', 'Ἒ'],
    '17': ['1F12', 'ἒ'],
    '18': ['1F19', 'Ἑ'],
    '19': ['1F11', 'ἑ'],
    '20': ['1F1D', 'Ἕ'],
    '21': ['1F15', 'ἕ'],
    '22': ['1F13', 'ἓ'],
    '23': ['1F1B', 'Ἓ'],
    '24': ['03AD', 'έ'],
    '25': ['0388', 'Έ'],
    '26': ['1FC8', 'Ὲ'],
    '27': ['03B5 035C', 'ε͜']
    }
    zeta = {
    '1': ['0396', 'Ζ'],
    '2': ['03B6', 'ζ']
    }
    eta = {
    '1': ['03B7', 'η'],
    '2': ['0397', 'Η'],
    '5': ['1F20', 'ἠ'],
    '6': ['1F2C', 'Ἤ'],
    '7': ['1F24', 'ἤ'],
    '8': ['1F9C', 'ᾜ'],
    '9': ['1F94', 'ᾔ'],
    '10': ['1F2A', 'Ἢ'],
    '11': ['1F22', 'ἢ'],
    '12': ['1F92', 'ᾒ'],
    '13': ['1F26', 'ἦ'],
    '14': ['1F2E', 'Ἦ'],
    '15': ['1F9E', 'ᾞ'],
    '16': ['1F96', 'ᾖ'],
    '17': ['1F98', 'ᾘ'],
    '18': ['1F21', 'ἡ'],
    '19': ['1F29', 'Ἡ'],
    '20': ['1F25', 'ἥ'],
    '21': ['1F2D', 'Ἥ'],
    '22': ['1F9D', 'ᾝ'],
    '23': ['1F95', 'ᾕ'],
    '24': ['1F2B', 'Ἣ'],
    '25': ['1F23', 'ἣ'],
    '26': ['1F93', 'ᾓ'],
    '27': ['1F27', 'ἧ'],
    '28': ['1F2F', 'Ἧ'],
    '29': ['1F9F', 'ᾟ'],
    '30': ['1F97', 'ᾗ'],
    '31': ['1F91', 'ᾑ'],
    '32': ['1F99', 'ᾙ'],
    '33': ['0389', 'Ή'],
    '34': ['1F28', 'Ἠ'],
    '35': ['03AE', 'ή'],
    '36': ['1FC4', 'ῄ'],
    '37': ['1F74', 'ὴ'],
    '38': ['1FCA', 'Ὴ'],
    '39': ['1FC6', 'ῆ'],
    '40': ['1FC7', 'ῇ'],
    '41': ['1FCC', 'ῌ'],
    '42': ['1F90', 'ᾐ'],
    '43': ['1FC2', 'ῂ'],
    '44': ['1FC3', 'ῃ'],
    '45': ['03B7 035C', 'η͜']
    }
    theta = {
  '1': ['03b8', 'θ'],
  '2': ['0398', 'Θ']
    }
    iota = {
    '1': ['00ED', 'í'],
    '2': ['00CD', 'Í'],
    '3': ['1FD3', 'ΐ'],
    '4': ['00CC', 'Ì'],
    '5': ['00CE', 'Î'],
    '6': ['00EE', 'î'],
    '7': ['00CF', 'Ï'],
    '8': ['0399', 'Ι'],
    '9': ['03B9', 'ι'],
    '10': ['03B9 0323', 'ι̣'],
    '11': ['1F30', 'ἰ'],
    '12': ['1F38', 'Ἰ'],
    #'13': ['1F34 03B9', 'ἴ'],
    '14': ['1F34', 'ἴ'],
    #'15': ['1F3C 0399', 'Ἴ'],
    '16': ['1F3C', 'Ἴ'],
    #'17': ['1F32 03B9', '17'],
    '18': ['1F32', 'ἲ'],
    #'19': ['1F3A 0399', '19'],
    '20': ['1F3A', 'Ἲ'],
    #'21': ['1F3E 0399', 'Ἶ'],
    '22': ['1F3E', 'Ἶ'],
    #'23': ['1F36 03B9', 'ἶ'],
    '24': ['1F36', 'ἶ'],
    '25': ['1F31', 'ἱ'],
    '26': ['1F39', 'Ἱ'],
    #'27': ['1F35 03B9', '27'],
    '28': ['1F35', 'ἵ'],
    #'29': ['1F3D 0399', '29'],
    '30': ['1F3D', 'Ἵ'],
    #'31': ['1F3B 03B9', '31'],
    '32': ['1F3B', 'Ἳ'],
    #'33': ['1F33 03B9', '33'],
    '34': ['1F33', 'ἳ'],
    #'35': ['1F37 03B9', '35'],
    '36': ['1F37', 'ἷ'],
    #'37': ['1F3F 0399', 'Ἷ'],
    '38': ['1F3F', 'Ἷ'],
    '39': ['038A', 'Ί'],
    '40': ['03AF', 'ί'],
    '41': ['1FD6', 'Ὶ'],
    '42': ['1F76', 'ὶ'],
    '43': ['1FD2', 'ῖ'],
    '44': ['03CA', 'ϊ'],
    '45': ['03AA', 'Ϊ'],
    '48': ['1FD3', '48'],
    '49': ['1FD7', 'ῗ'],
    '50': ['0390', '50'],
    '51': ['1FDA', '51'],
    '52': ['03B9 035C', 'ι͜']
    }
    kappa = {
    '1': ['039A', 'Κ'],
    '2': ['03BA', 'κ']
    }
    llambda = {
    '1': ['039B', 'Λ'],
    '2': ['03BB', 'λ'],
    '3': ['03BB 0323', 'λ̣']
    }
    mu = {
    '1': ['00B5', 'µ'],
    '2': ['03BC', 'μ'],
    '3': ['03BC 0323', 'μ̣'],
    '4': ['039C', 'Μ']
    }
    nu = {
    '1': ['03BD', 'ν'],
    '2': ['039D', 'Ν'],
    '3': ['03BD 0323', 'ν̣']
    }
    xi = {
    '1': ['039E', 'Ξ'],
    '1': ['03BE', 'ξ']
    }
    omicron = {
    '1': ['00D3', 'Ó'],
    '2': ['00F3', 'ó'],
    '3': ['00D2', 'Ò'],
    '4': ['00F4', 'ô'],
    '5': ['00F6', 'ö'],
    '6': ['00D6', 'Ö'],
    '7': ['03BF', 'ο'],
    '8': ['03BF 0323', 'ο̣'],
    '9': ['039F', 'Ο'],
    '10': ['1F40', 'ὀ'],
    '12': ['1F44', 'ὄ'],
    '14': ['1F42', 'ὂ'],
    '15': ['1F48', 'Ὂ'],
    '16': ['1F41', 'ὁ'],
    '17': ['1F4D', 'Ὅ'],
    '18': ['1F45', 'ὅ'],
    '19': ['1F4B', 'Ὃ'],
    '20': ['1F43', 'ὃ'],
    '21': ['038C', 'Ό'],
    '22': ['03CC', 'ό'],
    '23': ['1F78', 'ὸ'],
    '24': ['1FF8', 'Ὸ'],
    '25': ['1F4C', 'Ὸ'],
    '26': ['1F49', 'Ὁ'],
    '27': ['1F4A', 'Ὂ'],
    '28': ['03BF 035C', 'ο͜']
    }
    pi = {
    '1': ['03A0', 'Π'],
    '2': ['03C0', 'π'],
    '3': ['03C0 0323', 'π̣']
    }
    rho = {
    '1': ['03A1', 'Ρ'],
    '2': ['03C1', 'ρ'],
    '3': ['03C1 0323', 'ρ̣'],
    '4': ['1FE4', 'ῤ'],
    '5': ['1FE5', 'ῥ'],
    '6': ['1FEC', 'Ῥ'],
    '7': ['03F1', 'ϼ']
    }
    sigma = {
    "1": ["03F9", "Ϲ"],
    "2": ["03A3", "Σ"],
    "3": ["03C3", "σ"],
    "4": ["03FE", "Ͼ"],
    "5": ["03FD", "Ͻ"],
    "6": ["03FF", "Ͽ"],
    "7": ["03F2", "ϲ"],
    "8": ["1D6BA", "𝚺"],
    "9": ["1D6D4", "𝛔"],
    "10": ["1D6F4", "𝛴"],
    "11": ["1D70E", "𝜎"],
    "12": ["1D72E", "𝜮"],
    "13": ["1D748", "𝝈"],
    "14": ["1D768", "𝝨"],
    "15": ["1D782", "𝞂"],
    "16": ["1D7A2", "𝞢"],
    "17": ["1D7BC", "𝞼"]
    }

    end_sigma = {
    "1": ["03C2", "ς"],
    '2': ['03DB', 'ϛ'],
    "3": ["1D6D3", "𝛓"],
    '4': ['1D70D', '𝜍'],
    "5": ["1D747", "𝝇"],
    '6': ['1D781', '𝞁'],
    "7": ["1D7BB", "𝞻"]
    }
    tau = {
    '1': ['03A4', 'Τ'],
    '2': ['03C4', 'τ'],
    '3': ['03C4 0323', 'τ̣']
    }
    upsilon = {
    '1': ['00FA', 'ú'],
    '2': ['00DA', 'Ú'],
    '3': ['00DB', 'Û'],
    '4': ['00DC', 'Ü'],
    '5': ['00FC', 'ü'],
    '6': ['03A5', 'Υ'],
    '7': ['03C5', 'υ'],
    '8': ['1F50', 'ὐ'],
    '9': ['1F54', 'ὔ'],
    '10': ['1F52', 'ὒ'],
    '11': ['1F56', 'ὖ'],
    '12': ['1F51', 'ὑ'],
    '13': ['1F59', 'Ὑ'],
    '14': ['1F55', 'ὕ'],
    '15': ['1F5D', 'Ὕ'],
    '16': ['1F5B', 'Ὓ'],
    '17': ['1F53', 'ὓ'],
    '18': ['1F57', '5'],
    '19': ['1F5F', 'Ὗ'],
    '20': ['1FEB', 'Ύ'],
    '21': ['038E', 'Ύ'],
    '22': ['03CD', 'ύ'],
    '23': ['1F7A', 'Ὺ'],
    '24': ['1F50', '24'],
    '25': ['03C5 0323', '25'],
    '26': ['03AB', 'Ϋ'],
    '27': ['03CB', 'ϋ'],
    '28': ['03B0', 'ΰ'],
    '29': ['1FE7', '29'],
    '30': ['1FE6', 'ῢ'],
    '31': ['1FE7 0342', '31'],
    '32': ['1FEA', 'Ὺ'],
    '33': ['1FE3', 'ΰ'],
    '34': ['03C5 035C', 'υ͜']
    }
    phi = {
    '1': ['03A6', 'Φ'],
    '2': ['03C6', 'φ']
    }
    chi = {
    '1': ['03A7', 'Χ'],
    '2': ['03C7', 'χ']
    }
    psi = {
    "1": ["03A8", "Ψ"],
    "2": ["03C8", "ψ"]
    }
    omega = {
    "1": ["03A9", "Ω"],
    "2": ["03C9", "ω"],
    "3": ["1F60", "ὠ"],
    "4": ["1F68", "Ὠ"],
    "5": ["1F64", "ὤ"],
    "6": ["1F6C", "Ὤ"],
    "7": ["1F64 0342", "ᾤ"],
    "8": ["1F6C 0342", "8"],
    "9": ["1F6C", "ᾬ"],
    "10": ["1F62", "ὢ"],
    "11": ["1F6A", "Ὢ"],
    "12": ["1F62 0342", "ᾢ"],
    "13": ["1F62", "ᾢ"],
    "14": ["1F6E", "Ὦ"],
    "15": ["1F66", "ὦ"],
    "16": ["1F6E 0342", "16"],
    "17": ["1F6E", "ᾮ"],
    "18": ["1F66 0342", "18"],
    "19": ["1F66", "ᾦ"],
    "20": ["1F60 0342", "ᾠ"],
    "21": ["1F60", "ᾠ"],
    "22": ["1F69", "Ὡ"],
    "23": ["1F61", "ὡ"],
    "24": ["1F65", "ὥ"],
    "25": ["1F6D", "Ὥ"],
    "26": ["1F65 0342", "26"],
    "27": ["1F65", "ᾥ"],
    "28": ["1F6D 0342", "ᾭ"],
    "29": ["1F6D", "ᾭ"],
    "30": ["1F6B", "Ὣ"],
    "31": ["1F63", "ὣ"],
    "32": ["1F6F", "Ὧ"],
    "33": ["1F67", "ὧ"],
    "34": ["1F67 0342", "ᾧ"],
    "35": ["1F67", "ᾧ"],
    "36": ["1F6F 0342", "ᾯ"],
    "37": ["1F6F", "ᾯ"],
    "38": ["1F61 0342", "38"],
    "39": ["1F61", "ᾡ"],
    "40": ["038F", "Ώ"],
    "41": ["03CE", "ώ"],
    "42": ["1FF4", "ῴ"],
    "43": ["1FFA", "Ὼ"],
    "44": ["1F7C", "ὼ"],
    "45": ["1FF2", "ῲ"],
    "46": ["1FF6", "ῶ"],
    "47": ["1FF7", "ῷ"],
    "49": ["03C9", "ῳ"],
    "50": ["1FF3", "50"],
    "51": ["1FA0", "51"],
    "52": ["1FA4", "52"],
    '54': ['1FFC', 'ῼ'],
    '55': ['03C9 0323', 'ω̣'],
    '56': ['1FAF', 'ᾯ'],
    '57': ['1FA6', 'ᾦ'],
    '58': ['1FAC', 'ᾬ'],
    '59': ['1FA5', 'ᾥ'],
    '60': ['1FA1', 'ᾡ'],
    '61': ['1FAE', 'ᾮ'],
    '62': ['1FA2', 'ᾢ'],
    '63': ['1FAD', 'ᾭ'],
    '64': ['03C9 035C', 'ω͜']
    }

    with open('normalization.TSV', mode='w') as file:
        for key, value in alpha.items():
            file.write(f"{value[0]}\t03B1 # {value[1]} => α\n")
        ls = letter_check('α')
        for item in ls:
            file.write(f"{item[0]}\t03B1 # {item[1]} => α\n")


        for key, value in beta.items():
            file.write(f"{value[0]}\t03B2 # {value[1]} => β\n")
        ls = letter_check('β')
        for item in ls:
            file.write(f"{item[0]}\t03B2 # {item[1]} => β\n")


        for key, value in gamma.items():
            file.write(f"{value[0]}\t03B3 # {value[1]} => γ\n")
        ls = letter_check('γ')
        for item in ls:
            file.write(f"{item[0]}\t03B3 # {item[1]} => γ\n")


        for key, value in delta.items():
            file.write(f"{value[0]}\t03B4 # {value[1]} => δ\n")
        ls = letter_check('δ')
        for item in ls:
            file.write(f"{item[0]}\t03B4 # {item[1]} => δ\n")


        for key, value in epsilon.items():
            file.write(f"{value[0]}\t03B5 # {value[1]} => ε\n")
        ls = letter_check('ε')
        for item in ls:
            file.write(f"{item[0]}\t03B5 # {item[1]} => ε\n")


        for key, value in zeta.items():
            file.write(f"{value[0]}\t03B6 # {value[1]} => ζ\n")
        ls = letter_check('ζ')
        for item in ls:
            file.write(f"{item[0]}\t03B6 # {item[1]} => ζ\n")


        for key, value in eta.items():
            file.write(f"{value[0]}\t03B7 # {value[1]} => η\n")
        ls = letter_check('η')
        for item in ls:
            file.write(f"{item[0]}\t03B7 # {item[1]} => η\n")


        for key, value in theta.items():
            file.write(f"{value[0]}\t03B8 # {value[1]} => θ\n")
        ls = letter_check('θ')
        for item in ls:
            file.write(f"{item[0]}\t03B8 # {item[1]} => θ\n")


        for key, value in iota.items():
            file.write(f"{value[0]}\t03B9 # {value[1]} => ι\n")
        ls = letter_check('ι')
        for item in ls:
            file.write(f"{item[0]}\t03B9 # {item[1]} => ι\n")


        for key, value in kappa.items():
            file.write(f"{value[0]}\t03BA # {value[1]} => κ\n")
        ls = letter_check('κ')
        for item in ls:
            file.write(f"{item[0]}\t03BA # {item[1]} => κ\n")


        for key, value in llambda.items():
            file.write(f"{value[0]}\t03BB # {value[1]} => λ\n")
        ls = letter_check('λ')
        for item in ls:
            file.write(f"{item[0]}\t03BB # {item[1]} => λ\n")


        for key, value in mu.items():
            file.write(f"{value[0]}\t03BC # {value[1]} => μ\n")
        ls = letter_check('μ')
        for item in ls:
            file.write(f"{item[0]}\t03BC # {item[1]} => μ\n")


        for key, value in nu.items():
            file.write(f"{value[0]}\t03BD # {value[1]} => ν\n")
        ls = letter_check('ν')
        for item in ls:
            file.write(f"{item[0]}\t03BD # {item[1]} => ν\n")


        for key, value in xi.items():
            file.write(f"{value[0]}\t03BE # {value[1]} => ξ\n")
        ls = letter_check('ξ')
        for item in ls:
            file.write(f"{item[0]}\t03BE # {item[1]} => ξ\n")


        for key, value in omicron.items():
            file.write(f"{value[0]}\t03BF # {value[1]} => ο\n")
        ls = letter_check('ο')
        for item in ls:
            file.write(f"{item[0]}\t03BF # {item[1]} => ο\n")


        for key, value in pi.items():
            file.write(f"{value[0]}\t03C0 # {value[1]} => π\n")
        ls = letter_check('π')
        for item in ls:
            file.write(f"{item[0]}\t03C0 # {item[1]} => π\n")


        for key, value in rho.items():
            file.write(f"{value[0]}\t03C1 # {value[1]} => ρ\n")
        ls = letter_check('ρ')
        for item in ls:
            file.write(f"{item[0]}\t03C1 # {item[1]} => ρ\n")


        for key, value in end_sigma.items():
            file.write(f"{value[0]}\t03C2 # {value[1]} => ς\n")


        for key, value in sigma.items():
            file.write(f"{value[0]}\t03C3 # {value[1]} => σ\n")


        for key, value in tau.items():
            file.write(f"{value[0]}\t03C4 # {value[1]} => τ\n")
        ls = letter_check('τ')
        for item in ls:
            file.write(f"{item[0]}\t03C4 # {item[1]} => τ\n")


        for key, value in upsilon.items():
            file.write(f"{value[0]}\t03C5 # {value[1]} => υ\n")
        ls = letter_check('υ')
        for item in ls:
            file.write(f"{item[0]}\t03C5 # {item[1]} => υ\n")


        for key, value in phi.items():
            file.write(f"{value[0]}\t03C6 # {value[1]} => φ\n")
        ls = letter_check('φ')
        for item in ls:
            file.write(f"{item[0]}\t03C6 # {item[1]} => φ\n")


        for key, value in chi.items():
            file.write(f"{value[0]}\t03C7 # {value[1]} => χ\n")
        ls = letter_check('χ')
        for item in ls:
            file.write(f"{item[0]}\t03C7 # {item[1]} => χ\n")


        for key, value in psi.items():
            file.write(f"{value[0]}\t03C8 # {value[1]} => ψ\n")
        ls = letter_check('ψ')
        for item in ls:
            file.write(f"{item[0]}\t03C8 # {item[1]} => ψ\n")


        for key, value in omega.items():
            file.write(f"{value[0]}\t03C9 # {value[1]} => ω\n")
        ls = letter_check('ω')
        for item in ls:
            file.write(f"{item[0]}\t03C9 # {item[1]} => ω\n")


if __name__ == '__main__':
    start_time = time.time()
    main()
    print("--- %s minutes ---" % ((time.time() - start_time) / 60))